IDS_LOCK_APPLY_NEW_PROJ                       = "It will be applied in the new project."
IDS_MAIN_PROTECTION_KEYTYPE_STANDALONE        = "Stand-alone"
IDS_MAIN_PROTECTION_KEYTYPE_NETWORK           = "Network"
IDS_MAIN_PROTECTION_KEYTYPE_LICENSE_SERVER    = "License-Server"
IDS_MAIN_PROTECTION_PROTOCOL_TCPIP            = "TCP/IP"
IDS_MAIN_PROTECTION_PROTOCOL_IPXSPX           = "IPX/SPX"
IDS_MAIN_PROTECTION_PROTOCOL_NETBEUI          = "NetBEUI"
IDS_MAIN_PROTECTION_PROTOCOL_SAP              = "SAP"

IDS_MAIN_MANUAL_FILE_NOT_EXIST                = "Manual File is not Exist."
IDS_MAIN_TOOLTIP_KEEP_SECT_REBAR01            = "Section and Rebar information is maintained."
IDS_MAIN_TOOLTIP_KEEP_SECT_REBAR02            = "Only the Member force and other Design Information are updated by Gen/ADS Link."

IDS_MEC_ERROR_FAIL_WEB_AUTH                   = "Authentication Failed"
IDS_MEC_LONG_USERID                           = "User ID is too long."
IDS_MEC_LONG_PASSWORD                         = "Password is too long."
IDS_MEC_ENTER_USERID                          = "Please enter your User ID."
IDS_MEC_ENTER_PASSWORD                        = "Please enter your User password."
IDS_MEC_CONFIRM_NODELOCK_SYSTEM               = "For the node lock option, this system will be set permanently.\nDo you really want to register this system?"
IDS_MEC_REGISTRAITON_SUCCESS                  = "Your registration has been successfully realized."
IDS_MEC_TRANSLATION_SUCCESS                   = "The %s file has been translated successfully."

IDS_MAIN_PROTECTION__Err_Lock_Key_Number      = "[Error] %d th character of protection key number is not a valid hex character."
IDS_MAIN_PROTECTION__Err_Lock_Key_Number_16   = "[Error] Protection Key Number is a 16-digit number."
IDS_MAIN_PROTECTION_KEYTYPE_INTERNET          = "Internet"
IDS_MAIN_PROTECTION_WEBTYPE_NODE              = "Node Lock"
IDS_MAIN_PROTECTION_WEBTYPE_FLOATING          = "Floating Lock"
IDS_MAIN_PROTECTION_INPUT_IDPW                = "Enter ID and password."
IDS_MAIN_PROTECTION_cannot_change_any_program_options_at_work  = "Program option cannot be changed during running the project."
IDS_MAIN_PROTECTION_Another_application_is_already_running_at_this_system  = "Another application is already running at this system. \nTherefore the option cannot be deactivated."
IDS_MAIN_PROTECTION_INITIALIZE                = "Do you wish to initialize the authentication data?"
IDS_MAIN_PROTECTION_INITIALIZE_FAIL           = "Initialization has been failed."
IDS_MAIN_PROTECTION_INITIALIZE_SUCCEED        = "Authentication data has been initialized."
IDS_MAIN_PROTECTION_Hardware_Lock             = "Hardware Lock"

IDS_MAIN_PROCEDURE_DGN                        = "Design Procedure"
IDS_MAIN_PROCEDURE_RCS                        = "RC Design Procedure"
IDS_MAIN_PROCEDURE_STL                        = "Steel Design Procedure"
IDS_MAIN_PROCEDURE_SRC                        = "SRC Design Procedure"
IDS_MAIN_PROCEDURE_ALU                        = "Aluminum Design Procedure"

IDS_MAIN_MATERIAL_NAME_RCS                    = "RC"
IDS_MAIN_MATERIAL_NAME_STL                    = "Steel"
IDS_MAIN_MATERIAL_NAME_SRC                    = "SRC"
IDS_MAIN_MATERIAL_NAME_ALU                    = "Aluminum"
IDS_MAIN_MATERIAL_NAME_RFM                    = "Reinforce"
IDS_MAIN_MATERIAL_NAME_PBD                    = "Peform-Base Design"
IDS_MAIN_MATERIAL_NAME_CFS                    = "Cold-Form Section"
IDS_MAIN_MATERIAL_NAME_RCS_CAP                = "RC"
IDS_MAIN_MATERIAL_NAME_STL_CAP                = "STEEL"
IDS_MAIN_MATERIAL_NAME_SRC_CAP                = "SRC"
IDS_MAIN_MATERIAL_NAME_ALU_CAP                = "ALUMINUM"
IDS_MAIN_MATERIAL_NAME_RFM_CAP                = "REINFORCE"
IDS_MAIN_MATERIAL_NAME_PBD_CAP                = "PEFORM-BASE DESIGN"
IDS_MAIN_MATERIAL_NAME_CFS_CAP                = "COLD-FORM SECTION"

IDS_MAIN_MEMBER_NAME_PINFO                    = "Project Information"
IDS_MAIN_MEMBER_NAME_GUOPT                    = "Option"
IDS_MAIN_MEMBER_NAME_DBASE                    = "Data Base"
IDS_MAIN_MEMBER_NAME_GUSOP                    = "Steel Option"
IDS_MAIN_MEMBER_NAME_GUAOP                    = "Aluminum Option"
IDS_MAIN_MEMBER_NAME_DGNOP                    = "Design Option ( Member )"
IDS_MAIN_MEMBER_NAME_DWGOP                    = "Drawing Option ( Member )"
IDS_MAIN_MEMBER_NAME_GPREF                    = "Preference"
IDS_MAIN_MEMBER_NAME_GROUP                    = "Group"
IDS_MAIN_MEMBER_NAME_GLOAD                    = "Design Load"
IDS_MAIN_MEMBER_NAME_GLIOP                    = "Link Option"
IDS_MAIN_MEMBER_NAME_GULOP                    = "UP Link Option"
IDS_MAIN_MEMBER_NAME_GURWO                    = "Batch Wall Design Option"
IDS_MAIN_MEMBER_NAME_GLINK                    = "Link"
IDS_MAIN_MEMBER_NAME_CHKOP                    = "Check Option"
IDS_MAIN_MEMBER_NAME_RPTOP                    = "Report Option"
IDS_MAIN_MEMBER_NAME_LAYOP                    = "Rebar Layout Option"
IDS_MAIN_MEMBER_NAME_NUMOP                    = "Number Option"
IDS_MAIN_MEMBER_NAME_REBAR                    = "Rebar Option"
IDS_MAIN_MEMBER_NAME_RFACT                    = "User-defined Strength Reduction Factor"

IDS_MAIN_MEMBER_NAME_GSLAB                    = "Slab"
IDS_MAIN_MEMBER_NAME_GURBE                    = "Beam & Girder"
IDS_MAIN_MEMBER_NAME_GURCO                    = "Column"
IDS_MAIN_MEMBER_NAME_GURGC                    = "Column ( General )"
IDS_MAIN_MEMBER_NAME_GURSW                    = "Shear Wall"
IDS_MAIN_MEMBER_NAME_GURDW                    = "Shear Wall ( Combined )"
IDS_MAIN_MEMBER_NAME_GUFDN                    = "Footing"
IDS_MAIN_MEMBER_NAME_GUFDL                    = "Footing ( Line )"
IDS_MAIN_MEMBER_NAME_GUCBF                    = "Footing ( General Combined )"
IDS_MAIN_MEMBER_NAME_GURCF                    = "Footing ( Combined )"
IDS_MAIN_MEMBER_NAME_GURBW                    = "Basement Wall"
IDS_MAIN_MEMBER_NAME_GURBU                    = "Buttress"
IDS_MAIN_MEMBER_NAME_GURST                    = "Stair"
IDS_MAIN_MEMBER_NAME_GURCB                    = "Corbel & Bracket"
IDS_MAIN_MEMBER_NAME_GURSL                    = "Slab Table"
IDS_MAIN_MEMBER_NAME_GURBL                    = "Beam Table"

IDS_MAIN_MEMBER_NAME_GURBB                    = "Batch Beam"
IDS_MAIN_MEMBER_NAME_GBBOP                    = "Batch Beam ( Option )"
IDS_MAIN_MEMBER_NAME_GBBST                    = "Batch Beam ( Story )"
IDS_MAIN_MEMBER_NAME_GBBCN                    = "Batch Beam ( Connectivity )"
IDS_MAIN_MEMBER_NAME_GBBGR                    = "Batch Beam ( Grouping )"
IDS_MAIN_MEMBER_NAME_GBBBE                    = "Batch Beam ( RC Beam )"
IDS_MAIN_MEMBER_NAME_GBBCO                    = "Batch Beam ( RC Column )"
IDS_MAIN_MEMBER_NAME_GBBSW                    = "Batch Beam ( RC Wall )"
IDS_MAIN_MEMBER_NAME_GBBSG                    = "Batch Beam ( Steel Beam / Column )"

IDS_MAIN_MEMBER_NAME_GURBC                    = "Batch Column"
IDS_MAIN_MEMBER_NAME_GBCOP                    = "Batch Column ( Option )"
IDS_MAIN_MEMBER_NAME_GBCST                    = "Batch Column ( Story )"
IDS_MAIN_MEMBER_NAME_GBCCN                    = "Batch Column ( Connectivity )"
IDS_MAIN_MEMBER_NAME_GBCGR                    = "Batch Column ( Grouping )"
IDS_MAIN_MEMBER_NAME_GBCCO                    = "Batch Column ( RC Column )"
IDS_MAIN_MEMBER_NAME_GBCGC                    = "Batch Column ( RC General Column )"
IDS_MAIN_MEMBER_NAME_GBCBE                    = "Batch Column ( RC Beam )"
IDS_MAIN_MEMBER_NAME_GBCSW                    = "Batch Column ( RC Wall )"
IDS_MAIN_MEMBER_NAME_GBCSG                    = "Batch Column ( Steel Beam / Column )"

IDS_MAIN_MEMBER_NAME_GURGW                    = "Batch Wall"
IDS_MAIN_MEMBER_NAME_GBWOP                    = "Batch Wall ( Option )"
IDS_MAIN_MEMBER_NAME_GBWST                    = "Batch Wall ( Story )"
IDS_MAIN_MEMBER_NAME_GBWUW                    = "Batch Wall ( Unit Wall )"
IDS_MAIN_MEMBER_NAME_GBWWA                    = "Batch Wall ( Wall )"
IDS_MAIN_MEMBER_NAME_GBWWM                    = "Batch Wall ( Wall Mark )"
IDS_MAIN_MEMBER_NAME_GBWBE                    = "Batch Wall ( RC Beam )"
IDS_MAIN_MEMBER_NAME_GBWCO                    = "Batch Wall ( RC Column )"
IDS_MAIN_MEMBER_NAME_GBWSG                    = "Batch Wall ( Steel Beam / Column )"
IDS_MAIN_MEMBER_NAME_GURRW                    = "Retaining Wall"
IDS_MAIN_MEMBER_NAME_GURAB                    = "Anchor Bolt"

IDS_MAIN_MEMBER_NAME_GUSSG                    = "Beam / Column"
IDS_MAIN_MEMBER_NAME_GUSCF                    = "Cold-Formed Section"
IDS_MAIN_MEMBER_NAME_GUSBP                    = "Base Plate"
IDS_MAIN_MEMBER_NAME_GUSBC                    = "Bolt Connection"
IDS_MAIN_MEMBER_NAME_GUSMC                    = "Moment Bolt Connection"
IDS_MAIN_MEMBER_NAME_GUSWO                    = "Web Opening"
IDS_MAIN_MEMBER_NAME_GUSCG                    = "Crane Girder"
IDS_MAIN_MEMBER_NAME_GUSPG                    = "Purlin / Girth"
IDS_MAIN_MEMBER_NAME_GUSEP                    = "Embedded Plate"
IDS_MAIN_MEMBER_NAME_GUSWE                    = "Weld Connection"
IDS_MAIN_MEMBER_NAME_GUSLB                    = "Link Beam"
IDS_MAIN_MEMBER_NAME_GUSST                    = "Steel Stair"
IDS_MAIN_MEMBER_NAME_GUSWB                    = "Corrugated Web Beam"

IDS_MAIN_MEMBER_NAME_GUCCB                    = "Composite Beam"
IDS_MAIN_MEMBER_NAME_GUCCO                    = "Column"
IDS_MAIN_MEMBER_NAME_GUCFT                    = "CFT Column"
IDS_MAIN_MEMBER_NAME_GUCBP                    = "Base Plate"

IDS_MAIN_MEMBER_NAME_GUAMT                    = "Beam / Column ( General )"
IDS_MAIN_MEMBER_NAME_GUAAG                    = "Beam / Column"

IDS_MAIN_MEMBER_NAME_GUFSL                    = "RC Slab"
IDS_MAIN_MEMBER_NAME_GUFBE                    = "RC Beam"
IDS_MAIN_MEMBER_NAME_GUFCO                    = "RC Column"

IDS_MAIN_MEMBER_NAME_GSTUL                    = "Unbraced Length"
IDS_MAIN_MEMBER_NAME_GSTBS                    = "Brace Strength"
IDS_MAIN_MEMBER_NAME_GSTLS                    = "Link Stiffener"
IDS_MAIN_MEMBER_NAME_GSTBV                    = "Beam Strength with V Brace"

IDS_MAIN_MEMBER_NAME_GERCF                    = IDS_MAIN_MEMBER_NAME_GURCF
IDS_MAIN_MEMBER_NAME_GERBE                    = IDS_MAIN_MEMBER_NAME_GURBE
IDS_MAIN_MEMBER_NAME_GERCO                    = IDS_MAIN_MEMBER_NAME_GURCO
IDS_MAIN_MEMBER_NAME_GERGC                    = IDS_MAIN_MEMBER_NAME_GURGC
IDS_MAIN_MEMBER_NAME_GEFDN                    = IDS_MAIN_MEMBER_NAME_GUFDN
IDS_MAIN_MEMBER_NAME_GERSF                    = "Footing ( Strip )"

IDS_MAIN_MEMBER_NAME_GESSG                    = "Beam / Column"
IDS_MAIN_MEMBER_NAME_GESBP                    = "Base Plate"
IDS_MAIN_MEMBER_NAME_GESBC                    = "Bolt Connection"
IDS_MAIN_MEMBER_NAME_GESMC                    = "Moment Bolt Connection"

IDS_MAIN_MEMBER_NAME_GECCB                    = "Composite Beam"

IDS_MAIN_MEMBER_NAME_GIRBE                    = IDS_MAIN_MEMBER_NAME_GURBE
IDS_MAIN_MEMBER_NAME_GIRCO                    = IDS_MAIN_MEMBER_NAME_GURCO


IDS_MAIN_MEMBER_NAME_GIRBB                    = IDS_MAIN_MEMBER_NAME_GURBB
IDS_MAIN_MEMBER_NAME_GIBOP                    = IDS_MAIN_MEMBER_NAME_GBBOP
IDS_MAIN_MEMBER_NAME_GIBST                    = IDS_MAIN_MEMBER_NAME_GBBST
IDS_MAIN_MEMBER_NAME_GIBCN                    = IDS_MAIN_MEMBER_NAME_GBBCN
IDS_MAIN_MEMBER_NAME_GIBGR                    = IDS_MAIN_MEMBER_NAME_GBBGR
IDS_MAIN_MEMBER_NAME_GIBBE                    = IDS_MAIN_MEMBER_NAME_GBBBE
IDS_MAIN_MEMBER_NAME_GIBCO                    = IDS_MAIN_MEMBER_NAME_GBBCO
IDS_MAIN_MEMBER_NAME_GIBSW                    = IDS_MAIN_MEMBER_NAME_GBBSW
IDS_MAIN_MEMBER_NAME_GIBSG                    = IDS_MAIN_MEMBER_NAME_GBBSG

IDS_MAIN_MEMBER_NAME_GIRBC                    = IDS_MAIN_MEMBER_NAME_GURBC
IDS_MAIN_MEMBER_NAME_GICOP                    = IDS_MAIN_MEMBER_NAME_GBCOP
IDS_MAIN_MEMBER_NAME_GICST                    = IDS_MAIN_MEMBER_NAME_GBCST
IDS_MAIN_MEMBER_NAME_GICCN                    = IDS_MAIN_MEMBER_NAME_GBCCN
IDS_MAIN_MEMBER_NAME_GICGR                    = IDS_MAIN_MEMBER_NAME_GBCGR
IDS_MAIN_MEMBER_NAME_GICCO                    = IDS_MAIN_MEMBER_NAME_GBCCO
IDS_MAIN_MEMBER_NAME_GICGC                    = IDS_MAIN_MEMBER_NAME_GBCGC
IDS_MAIN_MEMBER_NAME_GICBE                    = IDS_MAIN_MEMBER_NAME_GBCBE
IDS_MAIN_MEMBER_NAME_GICSW                    = IDS_MAIN_MEMBER_NAME_GBCSW
IDS_MAIN_MEMBER_NAME_GICSG                    = IDS_MAIN_MEMBER_NAME_GBCSG

IDS_MAIN_MEMBER_NAME_GIRGW                    = IDS_MAIN_MEMBER_NAME_GURGW
IDS_MAIN_MEMBER_NAME_GIWOP                    = IDS_MAIN_MEMBER_NAME_GBWOP
IDS_MAIN_MEMBER_NAME_GIWST                    = IDS_MAIN_MEMBER_NAME_GBWST
IDS_MAIN_MEMBER_NAME_GIWUW                    = IDS_MAIN_MEMBER_NAME_GBWUW
IDS_MAIN_MEMBER_NAME_GIWWA                    = IDS_MAIN_MEMBER_NAME_GBWWA
IDS_MAIN_MEMBER_NAME_GIWWM                    = IDS_MAIN_MEMBER_NAME_GBWWM
IDS_MAIN_MEMBER_NAME_GIWBE                    = IDS_MAIN_MEMBER_NAME_GBWBE
IDS_MAIN_MEMBER_NAME_GIWCO                    = IDS_MAIN_MEMBER_NAME_GBWCO
IDS_MAIN_MEMBER_NAME_GIWSG                    = IDS_MAIN_MEMBER_NAME_GBWSG

IDS_MAIN_SYSTEM_TYPE_RCS                      = "RC"
IDS_MAIN_SYSTEM_TYPE_STL                      = "Steel"
IDS_MAIN_SYSTEM_TYPE_SRC                      = "SRC"
IDS_MAIN_SYSTEM_TYPE_SRC2                     = "SRC"
IDS_MAIN_SYSTEM_TYPE_ALU                      = "Aluminum"
IDS_MAIN_SYSTEM_TYPE_RFM                      = "Reinforce"
IDS_MAIN_SYSTEM_TYPE_PBD                      = "Peform-Base Design"
IDS_MAIN_SYSTEM_TYPE_PBD2                     = "PBD"
IDS_MAIN_SYSTEM_TYPE_CFS                      = "Cold Form"
IDS_MAIN_SYSTEM_TYPE_ETC                      = "Etc."
IDS_MAIN_SYSTEM_TYPE_FDN                      = "Footing"
IDS_MAIN_SYSTEM_TYPE_CON                      = "Connect"

IDS_MAIN_SYS_MEMB_NAME_MENU                   = "Menu"
IDS_MAIN_SYS_MEMB_NAME_REPORT                 = "Report Viewer"
IDS_MAIN_SYS_MEMB_NAME_GLOAD                  = "Design Load"
IDS_MAIN_SYS_MEMB_NAME_GSLAB                  = "Slab"
IDS_MAIN_SYS_MEMB_NAME_GURBE                  = "Beam"
IDS_MAIN_SYS_MEMB_NAME_GURCO                  = "Column"
IDS_MAIN_SYS_MEMB_NAME_GURGC                  = "Column ( General )"
IDS_MAIN_SYS_MEMB_NAME_GURSW                  = "Shear Wall"
IDS_MAIN_SYS_MEMB_NAME_GWALL                  = "Shear Wall ( Combined )"
IDS_MAIN_SYS_MEMB_NAME_GURDW                  = "Shear Wall ( Combined )"
IDS_MAIN_SYS_MEMB_NAME_GUFDN                  = "Footing"
IDS_MAIN_SYS_MEMB_NAME_GUCBF                  = "Footing ( General Combined )"
IDS_MAIN_SYS_MEMB_NAME_GURCF                  = "Footing ( Combined )"
IDS_MAIN_SYS_MEMB_NAME_GURBW                  = "Basement Wall"
IDS_MAIN_SYS_MEMB_NAME_GURBU                  = "Buttress"
IDS_MAIN_SYS_MEMB_NAME_GURCB                  = "Corbel / Bracket"
IDS_MAIN_SYS_MEMB_NAME_GURST                  = "Stair"
IDS_MAIN_SYS_MEMB_NAME_GURBL                  = "Beam Table"
IDS_MAIN_SYS_MEMB_NAME_GURSL                  = "Slab Table"
IDS_MAIN_SYS_MEMB_NAME_GURRW                  = "Retaining Wall"
IDS_MAIN_SYS_MEMB_NAME_GURAB                  = "Anchor Bolt"
IDS_MAIN_SYS_MEMB_NAME_GURBB                  = "Batch Beam"
IDS_MAIN_SYS_MEMB_NAME_GURBC                  = "Batch Column"
IDS_MAIN_SYS_MEMB_NAME_GURGW                  = "Batch Wall"

IDS_MAIN_SYS_MEMB_NAME_GUSSG                  = "Beam / Column"
IDS_MAIN_SYS_MEMB_NAME_GUSCF                  = "Cold Formed Section"
IDS_MAIN_SYS_MEMB_NAME_GUSBP                  = "Base Plate"
IDS_MAIN_SYS_MEMB_NAME_GUSBC                  = "Bolt Connection"
IDS_MAIN_SYS_MEMB_NAME_GUSMC                  = "Moment Bolt Connection"
IDS_MAIN_SYS_MEMB_NAME_GUSCG                  = "Crane Girder"
IDS_MAIN_SYS_MEMB_NAME_GUSPG                  = "Purlin / Girth"
IDS_MAIN_SYS_MEMB_NAME_GUSWO                  = "Web Opening"
IDS_MAIN_SYS_MEMB_NAME_GUSEP                  = "Embedded Plate"
IDS_MAIN_SYS_MEMB_NAME_GUSWE                  = "Welding"
IDS_MAIN_SYS_MEMB_NAME_GUSST                  = "Steel Stair"
IDS_MAIN_SYS_MEMB_NAME_GUSWB                  = "Corrugated Web Beam"

IDS_MAIN_SYS_MEMB_NAME_GUCCB                  = "Composite Beam"
IDS_MAIN_SYS_MEMB_NAME_GUCCO                  = "Column"
IDS_MAIN_SYS_MEMB_NAME_GUCFT                  = "CFT Column"
IDS_MAIN_SYS_MEMB_NAME_GUCBP                  = "Base Plate"

IDS_MAIN_SYS_MEMB_NAME_GUFSL                  = "Slab"
IDS_MAIN_SYS_MEMB_NAME_GUFBE                  = "Beam"
IDS_MAIN_SYS_MEMB_NAME_GUFCO                  = "Column"

IDS_MAIN_SYS_MEMB_NAME_GUAMT                  = "Beam / Column ( General )"
IDS_MAIN_SYS_MEMB_NAME_GUAAG                  = "Beam / Column"

IDS_MAIN_SYS_MEMB_NAME_GERBE                  = IDS_MAIN_SYS_MEMB_NAME_GURBE
IDS_MAIN_SYS_MEMB_NAME_GERCO                  = IDS_MAIN_SYS_MEMB_NAME_GURCO
IDS_MAIN_SYS_MEMB_NAME_GERGC                  = IDS_MAIN_SYS_MEMB_NAME_GURGC
IDS_MAIN_SYS_MEMB_NAME_GERDW                  = IDS_MAIN_SYS_MEMB_NAME_GURDW
IDS_MAIN_SYS_MEMB_NAME_GEFDN                  = IDS_MAIN_SYS_MEMB_NAME_GUFDN
IDS_MAIN_SYS_MEMB_NAME_GERCF                  = IDS_MAIN_SYS_MEMB_NAME_GURCF
IDS_MAIN_SYS_MEMB_NAME_GERSF                  = "Footing ( Strip )"

IDS_MAIN_SYS_MEMB_NAME_GESSG                  = IDS_MAIN_SYS_MEMB_NAME_GUSSG
IDS_MAIN_SYS_MEMB_NAME_GESBC                  = IDS_MAIN_SYS_MEMB_NAME_GUSBC
IDS_MAIN_SYS_MEMB_NAME_GESBP                  = IDS_MAIN_SYS_MEMB_NAME_GUSBP
IDS_MAIN_SYS_MEMB_NAME_GESMC                  = IDS_MAIN_SYS_MEMB_NAME_GUSMC

IDS_MAIN_SYS_MEMB_NAME_GECCB                  = IDS_MAIN_SYS_MEMB_NAME_GUCCB

IDS_MAIN_SYS_MEMB_NAME_GISBC                  = IDS_MAIN_SYS_MEMB_NAME_GUSBC

IDS_MAIN_STDG_GRID_ERR_MSG1                   = "[ Error ] The contents to be pasted must be one column."
IDS_MAIN_STDG_GRID_ERR_MSG2                   = "[ Error ] The selected range to past the data is not identical to the copied data range."
IDS_MAIN_STDG_GRID_ERR_MSG3                   = "[ Error ] Group Name %s does not exist."
IDS_MAIN_STDG_GRID_ERR_MSG4                   = "[ Error ] The location to paste the data has not been assigned."
IDS_MAIN_STDG_GRID_ERR_MSG5                   = "[ Error ] The copied contents are out of the table range."
IDS_MAIN_STDG_GRID_ERR_PASTE                  = "[ Error ] The table is not expanded by Paste."

IDS_MAIN_CALC_NON_MEMBER                      = "There is no element to calculate."
IDS_MAIN_OUT_NON_MEMBER                       = "There is no element to print."
IDS_MAIN_DGN_CALC_FAIL                        = "Calculation failed for %s."
IDS_MAIN_DGN_INVALID_RCCODE					  = "Concrete standard is not compatible with steel standard for checking bolt. Concrete standard : %s"

IDS_MAIN_NOT_EXIST_GEN_FILE__s                = "midas Gen executable file does not exist.\nPath : %s"
IDS_MAIN_RENAME_ERROR_ONE_ITEM                = "Try again. One item can be renamed at once."

IDS_MAIN_GENERATE_DWG__s__s                   = "Generating Dwg File : %s %s"

IDS_MAIN_HYPER_LINK_ERROR_MEM                 = "The operating system is out\nof memory or resources."
IDS_MAIN_HYPER_LINK_ERROR_PATH                = "The specified path was not found."
IDS_MAIN_HYPER_LINK_ERROR_FILE                = "The specified file was not found."
IDS_MAIN_HYPER_LINK_ERROR_FORM                = "The .EXE file is invalid\n(non-Win32 .EXE or error in .EXE image)."
IDS_MAIN_HYPER_LINK_ERROR_ACCE                = "The operating system denied\naccess to the specified file."
IDS_MAIN_HYPER_LINK_ERROR_INCP                = "The filename association is\nincomplete or invalid."
IDS_MAIN_HYPER_LINK_ERROR_BUSY                = "The DDE transaction could not\nbe completed because other DDE transactions\nwere being processed."
IDS_MAIN_HYPER_LINK_ERROR_FAIL                = "The DDE transaction failed."
IDS_MAIN_HYPER_LINK_ERROR_TIME                = "The DDE transaction could not\nbe completed because the request time is out."
IDS_MAIN_HYPER_LINK_ERROR_DDL                 = "The specified dynamic-link library was not found."
IDS_MAIN_HYPER_LINK_ERROR_ASSO                = "There is no application associated\nwith the given filename extension."
IDS_MAIN_HYPER_LINK_ERROR_OOM                 = "There is no enough memory to complete the operation."
IDS_MAIN_HYPER_LINK_ERROR_SHAR                = "A sharing violation occurred."
IDS_MAIN_HYPER_LINK_ERROR__d                  = "Unknown Error (%d) occurred."
IDS_MAIN_HYPER_LINK_ERROR_OPEN                = "Unable to open hyperlink:\n\n"

IDS_MAIN_TITLE_START_PAGE                     = "Start Page"
IDS_MAIN_TITLE_MEMB                           = "Member"
IDS_MAIN_TITLE_MLST                           = "Member List"
IDS_MAIN_TITLE_DRAW                           = "Drawing"
IDS_MAIN_TITLE_QUAN                           = "Quantity"
IDS_MAIN_TITLE_VDRW                           = "Vector Draw"
IDS_MAIN_TITLE_CUSTOM                         = "Customize..."
IDS_MAIN_TITLE_STANDARD                       = "Standard"
IDS_MAIN_TITLE_RCS_DESIGN                     = "RC Design"
IDS_MAIN_TITLE_STL_DESIGN                     = "Steel Design"
IDS_MAIN_TITLE_SRC_DESIGN                     = "SRC Design"
IDS_MAIN_TITLE_ALU_DESIGN                     = "Aluminum Design"
IDS_MAIN_TITLE_MODE                           = "Mode"
IDS_MAIN_TITLE_OPT                            = "Option"
IDS_MAIN_TITLE_LINK                           = "Link"
IDS_MAIN_TITLE_WORK_BAR                       = "WorkBar"
IDS_MAIN_TITLE_REPORT                         = "Report"
IDS_MAIN_TITLE_DWG_PREVIEW                    = "Preview"
IDS_MAIN_TITLE_MEMBER_INFO                    = "Member Information"
IDS_MAIN_TITLE_WALL_INFO                      = "Wall Information"
IDS_MAIN_TITLE_MSG                            = "Message"
IDS_MAIN_TITLE_UNDO                           = "&Undo"
IDS_MAIN_TITLE_REDO                           = "&Redo"
IDS_MAIN_TITLE_CHEK                           = "Check"

IDS_MAIN_GDBB_NON_MEMB                        = "There is no batch beam data."
IDS_MAIN_GDBB_USE_LINK                        = "Use Gen Link to get data."
IDS_MAIN_GDBB_RUN_SMRT                        = "Run Smart Design for All Beam Data?"

IDS_MAIN_GDBC_NON_MEMB                        = "There is no batch column data."
IDS_MAIN_GDBC_USE_LINK                        = "Use Gen Link to get data."
IDS_MAIN_GDBC_RUN_SMRT                        = "Run Smart Design for All Column Data?"

IDS_MAIN_GDBW_NON_MEMB                        = "There is no batch wall data."
IDS_MAIN_GDBW_USE_LINK                        = "Use midas Link to get data."
IDS_MAIN_GDBW_RUN_SMRT                        = "Run Smart Design for All Wall Data?"

IDS_MAIN_FAIL_MAKE_RIBBON_MENU                = "Failed at Create_Menu()"
IDS_MAIN_FAIL_MAKE_OUTPUT                     = "Failed at Create_ToolBar()"
IDS_MAIN_FAIL_MAKE_WORK_TREE                  = "Failed at Create_WorkTree()"
IDS_MAIN_FAIL_MAKE_TOOL_BAR                   = "Failed at Create_Output()"

IDS_MAIN_FAIL_MAKE_STAT_BAR                   = "Failed to create status bar\n"
IDS_MAIN_FAIL_MAKE_OUTP_BAR                   = "Failed to create output bar\n"
IDS_MAIN_FAIL_MAKE_WORK_BAR                   = "Failed to create Workspace bar\n"
IDS_MAIN_FAIL_MAKE_REPORT_BAR                 = "Failed to create Report bar\n"
IDS_MAIN_FAIL_MAKE_DWG_PREVIEW_BAR            = "Failed to create Drawing Preview bar\n"
IDS_MAIN_FAIL_MAKE_MEMBER_INFO_BAR            = "Failed to create Member Information bar\n"
IDS_MAIN_FAIL_MAKE_MENU_BAR                   = "Failed to create menu bar\n"
IDS_MAIN_FAIL_MAKE_DWG                        = "Fail to create drawing file."
IDS_MAIN_FAIL_OPEN_DWG__s                     = "Cannot open %s"
IDS_MAIN_WALL_COLUMN_IMPORTED                 = "wall or column data will be imported."

IDS_MAIN_PROTECTION__Err_PKID_Number_16       = "[Error] Protection Key Number is consisted of 16 alphanumeric characters."
IDS_MAIN_DGN_GURDW_CALC_FAIL_NOT_COMBINED__s  = "Calculation failed for %s. Combined wall check can be performed when unit walls are connected to each other."

IDS_MAIN_SHOW_LOAD_COMBINATION_INFO           = "Display Load Combination Information."
IDS_MAIN_ABNORAML_SETUP_TRIAL_VERSION         = "The trial version program was not properly installed.\nPlease install the program again using SETUP.exe file. "
IDS_MAIN_ALLOWED_DURING_TIME                  = "The evaluation license will be expired after ###days from the time the program was installed.\n In order to use the software after ###days, please use the commercial version provided by midas IT Co., Ltd. It is not allowed to use the trial version after the valid evaluation period."
IDS_MAIN_INPUT_NAME                           = "Enter the name. "
IDS_MAIN_EXIST_SAME_NAME_INPUT_ANOTHER        = "Identical name exists. Enter the other name."
IDS_MAIN_FAIL_LINK                            = "Fail to link midas programs. "
IDS_MAIN_ENTER_USER_PASSWORD                  = "Please enter the password."
IDS_MAIN_USER_PASSWORD_TOO_LONG_ENTER_USER_PASSWORD  = "Password is too long.\nPlease enter the correct password again."
IDS_MAIN_ENTER_USER_ID                        = "Please enter the User ID."
IDS_MAIN_USER_ID_TOO_LONG_ENTER_USER_ID       = "Entered ID is too long.\nPlease enter the correct ID again."
IDS_MAIN_FAIL_AUTHENTICATION                  = "Authentication Failed"

IDS_MAIN_WORKTREE_BATCH_BEAM_SMART_OPT        = "Smart Design Option"
IDS_MAIN_WORKTREE_BATCH_BEAM_BUILD_DATA       = "Building Data Setting"
IDS_MAIN_WORKTREE_BATCH_BEAM_RUN_SMART        = "Run Smart Design ( All )"
IDS_MAIN_WORKTREE_BATCH_COLUMN_SMART_OPT      = "Smart Design Option"
IDS_MAIN_WORKTREE_BATCH_COLUMN_BUILD_DATA     = "Building Data Setting"
IDS_MAIN_WORKTREE_BATCH_COLUMN_RUN_SMART      = "Run Smart Design ( All )"
IDS_MAIN_WORKTREE_BATCH_WALL_SMART_OPT        = "Smart Design Option"
IDS_MAIN_WORKTREE_BATCH_WALL_BUILD_DATA       = "Building Data Setting"
IDS_MAIN_WORKTREE_BATCH_WALL_RUN_SMART        = "Run Smart Design ( All )"
IDS_MAIN_WORKTREE_DGN_CODE                    = "Design Code : %s"
IDS_MAIN_WORKTREE_DGN_CODE_RCS                = "RC : %s"
IDS_MAIN_WORKTREE_DGN_CODE_STL                = "Steel : %s"
IDS_MAIN_WORKTREE_DGN_CODE_SRC                = "SRC : %s"
IDS_MAIN_WORKTREE_DGN_CODE_CFS                = "Cold Form : %s"
IDS_MAIN_WORKTREE_DGN_CODE_ALU                = "Aluminum : %s"
IDS_MAIN_WORKTREE_DGN_CODE_RFM                = "Reinforce : %s"
IDS_MAIN_WORKTREE_LOAD_CODE_WIND              = "Wind Load : %s"
IDS_MAIN_WORKTREE_LOAD_CODE_SNOW              = "Snow Load : %s"
IDS_MAIN_WORKTREE_LOAD_CODE_LIVE              = "Live Load : %s"
IDS_MAIN_WORKTREE_DB_CODE_RBAR                = "Rebar DB : %s"
IDS_MAIN_WORKTREE_DB_CODE_MATL                = "Material DB : %s"
IDS_MAIN_WORKTREE_DB_CODE_SECT                = "Section DB : %s"
IDS_MAIN_WORKTREE_DB_CODE_MATL_FRP            = "Material DB ( FRP ) : %s"
IDS_MAIN_WORKTREE_DB_CODE_MATL_FRS            = "Material DB ( Steel ) : %s"
IDS_MAIN_WORKTREE_OPTION_STL                  = "Steel Option"
IDS_MAIN_WORKTREE_OPTION_ALU                  = "Aluminum Option"
IDS_MAIN_WORKTREE_DGN_OPTION                  = "Design Option"
IDS_MAIN_WORKTREE_DWG_OPTION                  = "Drawing Option"
IDS_MAIN_WORKTREE_RPT_OPTION                  = "Report Option"
IDS_MAIN_WORKTREE_PREFERENCE                  = "Preference"

IDS_MAIN_DLL_MSG_INCONSISTENT                 = "Version of DLL is inconsistent."
IDS_MAIN_DLL_MSG_CANNOT_FIND_DLL              = "Can't find %s."
